In [196]:
import pandas as pd
import numpy as np

df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [197]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [198]:
df['FlightNumber']=df['FlightNumber'].fillna(0)

In [199]:
num = []
for number in  df['FlightNumber']:
    if number == 0:
        num.append(num[-1]+10)
    else:
        num.append(int(number))
print(num)

[10045, 10055, 10065, 10075, 10085]

In [200]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           0.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           0.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [201]:
df['FlightNumber']=num

In [202]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

In [203]:
routes = []
for i in df['From_To']:
    after = i.split('_')
    routes.append(after)
print(routes)

[['LoNDon', 'paris'], ['MAdrid', 'miLAN'], ['londON', 'StockhOlm'], ['Budapest', 'PaRis'], ['Brussels', 'londOn']]

In [204]:
routes[0]

['LoNDon', 'paris']

In [205]:
from_add = []
for i in routes:
    from_add.append(i[0].capitalize())
print(from_add)

['London', 'Madrid', 'London', 'Budapest', 'Brussels']

In [206]:
to_add = []
for i in routes:
    to_add.append(i[1].capitalize())
print(to_add)

['Paris', 'Milan', 'Stockholm', 'Paris', 'London']

In [207]:
df['From'] = from_add

In [208]:
df

            From_To  FlightNumber  RecentDelays              Airline      From
0      LoNDon_paris         10045      [23, 47]               KLM(!)    London
1      MAdrid_miLAN         10055            []    <Air France> (12)    Madrid
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )    London
3    Budapest_PaRis         10075          [13]       12. Air France  Budapest
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"  Brussels

In [209]:
df['To'] = to_add

In [210]:
df

,From_To,FlightNumber,RecentDelays,Airline,From,To
0,LoNDon_paris,10045,"[23, 47]",KLM(!),London,Paris
1,MAdrid_miLAN,10055,[],<Air France> (12),Madrid,Milan
2,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. ),London,Stockholm
3,Budapest_PaRis,10075,[13],12. Air France,Budapest,Paris
4,Brussels_londOn,10085,"[67, 32]","""Swiss Air""",Brussels,London

In [211]:
df.drop(['From_To'],axis=1,inplace=True)

In [212]:
d1=[]
for i in df['RecentDelays']:
    try:
        d1.append(i[0])
    except IndexError as NaN:
        d1.append('NaN')

In [213]:
d1

[23, 'NaN', 24, 13, 67]

In [214]:
d2=[]
for i in df['RecentDelays']:
    try:
        d2.append(i[1])
    except IndexError as NaN:
        d2.append('NaN')

In [215]:
d2

[47, 'NaN', 43, 'NaN', 32]

In [216]:
d3=[]
for i in df['RecentDelays']:
    try:
        d3.append(i[2])
    except IndexError as NaN:
        d3.append('NaN')

In [217]:
d3

['NaN', 'NaN', 87, 'NaN', 'NaN']

In [218]:
df['delay_1'] = d1
df['delay_2'] = d2
df['delay_3'] = d3

In [219]:
df

,FlightNumber,RecentDelays,Airline,From,To,delay_1,delay_2,delay_3
0,10045,"[23, 47]",KLM(!),London,Paris,23,47,NaN
1,10055,[],<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,10065,"[24, 43, 87]",(British Airways. ),London,Stockholm,24,43,87
3,10075,[13],12. Air France,Budapest,Paris,13,NaN,NaN
4,10085,"[67, 32]","""Swiss Air""",Brussels,London,67,32,NaN